List<String> ukrainianNames1 = [
  'Артем', 'Максим', 'Олександр', 'Данило', 'Михайло', 'Іван', 'Андрій', 'Богдан', 'Єгор', 'Дмитро',
  'Юрій', 'Олег', 'Сергій', 'Владислав', 'Тимофій', 'Ростислав', 'Петро', 'Віталій', 'Тарас', 'Григорій',
  'Роман', 'Кирило', 'Василь', 'Ігор', 'Євген', 'Сава', 'Павло', 'Марк', 'Степан', 'Ярослав',
  'Захар', 'Лев', 'Антон', 'Остап', 'Семен', 'Мирослав', 'Федір', 'Святослав', 'Назар', 'Арсен',
  'Артур', 'Володимир', 'Матвій', 'Руслан', 'Валентин', 'Тимур', 'Ілля', 'Лук’ян', 'Мартин', 'Яків',
];

List<String> ukrainianNames2 = [
  'Богдан', 'Олексій', 'Єгор', 'Михайло', 'Макар', 'Іван', 'Артем', 'Олександр', 'Дем’ян', 'Назар',
  'Тимофій', 'Василь', 'Андрій', 'Матвій', 'Володимир', 'Кирило', 'Роман', 'Ярослав', 'Олег', 'Петро',
  'Тарас', 'Святослав', 'Юрій', 'Федір', 'Марк', 'Дмитро', 'Лев', 'Сергій', 'Мирон', 'Антон',
  'Сава', 'Тимур', 'Ілля', 'Лук’ян', 'Мартин', 'Григорій', 'Артур', 'Руслан', 'Павло', 'Віталій',
  'Остап', 'Ігор', 'Євген', 'Захар', 'Семен', 'Альберт', 'Валентин', 'Святослав', 'Ростислав', 'Борис',
];